Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hsdramc.h
/* -------- HSDRAMC_CR : (HSDRAMC Offset: 0x08) (R/W 32) Configuration Register -------- */
#define HSDRAMC_CR_NC_Pos                     _U_(0)                                               /**< (HSDRAMC_CR) Number of Column Bits Position */
#define HSDRAMC_CR_NC_Msk                     (_U_(0x7) << HSDRAMC_CR_NC_Pos)                      /**< (HSDRAMC_CR) Number of Column Bits Mask */
#define HSDRAMC_CR_NC(value)                  (HSDRAMC_CR_NC_Msk & ((value) << HSDRAMC_CR_NC_Pos))
#define   HSDRAMC_CR_NC_COL8_Val              _U_(0x0)                                             /**< (HSDRAMC_CR) 8 bits to define the column number, up to 256 columns  */
#define   HSDRAMC_CR_NC_COL9_Val              _U_(0x1)                                             /**< (HSDRAMC_CR) 9 bits to define the column number, up to 512 columns  */
#define   HSDRAMC_CR_NC_COL10_Val             _U_(0x2)                                             /**< (HSDRAMC_CR) 10 bits to define the column number, up to 1024 columns  */
#define   HSDRAMC_CR_NC_COL11_Val             _U_(0x3)                                             /**< (HSDRAMC_CR) 11 bits to define the column number, up to 2048 columns  */
#define   HSDRAMC_CR_NC_COL12_Val             _U_(0x4)                                             /**< (HSDRAMC_CR) 12 bits to define the column number, up to 4096 columns  */
#define HSDRAMC_CR_NC_COL8                    (HSDRAMC_CR_NC_COL8_Val << HSDRAMC_CR_NC_Pos)        /**< (HSDRAMC_CR) 8 bits to define the column number, up to 256 columns Position  */
#define HSDRAMC_CR_NC_COL9                    (HSDRAMC_CR_NC_COL9_Val << HSDRAMC_CR_NC_Pos)        /**< (HSDRAMC_CR) 9 bits to define the column number, up to 512 columns Position  */
#define HSDRAMC_CR_NC_COL10                   (HSDRAMC_CR_NC_COL10_Val << HSDRAMC_CR_NC_Pos)       /**< (HSDRAMC_CR) 10 bits to define the column number, up to 1024 columns Position  */
#define HSDRAMC_CR_NC_COL11                   (HSDRAMC_CR_NC_COL11_Val << HSDRAMC_CR_NC_Pos)       /**< (HSDRAMC_CR) 11 bits to define the column number, up to 2048 columns Position  */
#define HSDRAMC_CR_NC_COL12                   (HSDRAMC_CR_NC_COL12_Val << HSDRAMC_CR_NC_Pos)       /**< (HSDRAMC_CR) 12 bits to define the column number, up to 4096 columns Position  */
#define HSDRAMC_CR_NR_Pos                     _U_(3)                                               /**< (HSDRAMC_CR) Number of Row Bits Position */
#define HSDRAMC_CR_NR_Msk                     (_U_(0x3) << HSDRAMC_CR_NR_Pos)                      /**< (HSDRAMC_CR) Number of Row Bits Mask */
#define HSDRAMC_CR_NR(value)                  (HSDRAMC_CR_NR_Msk & ((value) << HSDRAMC_CR_NR_Pos))
#define   HSDRAMC_CR_NR_ROW11_Val             _U_(0x0)                                             /**< (HSDRAMC_CR) 11 bits to define the row number, up to 2048 rows  */
#define   HSDRAMC_CR_NR_ROW12_Val             _U_(0x1)                                             /**< (HSDRAMC_CR) 12 bits to define the row number, up to 4096 rows  */
#define   HSDRAMC_CR_NR_ROW13_Val             _U_(0x2)                                             /**< (HSDRAMC_CR) 13 bits to define the row number, up to 8192 rows  */
#define HSDRAMC_CR_NR_ROW11                   (HSDRAMC_CR_NR_ROW11_Val << HSDRAMC_CR_NR_Pos)       /**< (HSDRAMC_CR) 11 bits to define the row number, up to 2048 rows Position  */
#define HSDRAMC_CR_NR_ROW12                   (HSDRAMC_CR_NR_ROW12_Val << HSDRAMC_CR_NR_Pos)       /**< (HSDRAMC_CR) 12 bits to define the row number, up to 4096 rows Position  */
#define HSDRAMC_CR_NR_ROW13                   (HSDRAMC_CR_NR_ROW13_Val << HSDRAMC_CR_NR_Pos)       /**< (HSDRAMC_CR) 13 bits to define the row number, up to 8192 rows Position  */
#define HSDRAMC_CR_NB_Pos                     _U_(5)                                               /**< (HSDRAMC_CR) Number of Banks Position */
#define HSDRAMC_CR_NB_Msk                     (_U_(0x1) << HSDRAMC_CR_NB_Pos)                      /**< (HSDRAMC_CR) Number of Banks Mask */
#define HSDRAMC_CR_NB(value)                  (HSDRAMC_CR_NB_Msk & ((value) << HSDRAMC_CR_NB_Pos))
#define   HSDRAMC_CR_NB_BANK2_Val             _U_(0x0)                                             /**< (HSDRAMC_CR) 2 banks  */
#define   HSDRAMC_CR_NB_BANK4_Val             _U_(0x1)                                             /**< (HSDRAMC_CR) 4 banks  */
#define HSDRAMC_CR_NB_BANK2                   (HSDRAMC_CR_NB_BANK2_Val << HSDRAMC_CR_NB_Pos)       /**< (HSDRAMC_CR) 2 banks Position  */
#define HSDRAMC_CR_NB_BANK4                   (HSDRAMC_CR_NB_BANK4_Val << HSDRAMC_CR_NB_Pos)       /**< (HSDRAMC_CR) 4 banks Position  */
#define HSDRAMC_CR_CAS_Pos                    _U_(6)                                               /**< (HSDRAMC_CR) CAS Latency Position */
#define HSDRAMC_CR_CAS_Msk                    (_U_(0x3) << HSDRAMC_CR_CAS_Pos)                     /**< (HSDRAMC_CR) CAS Latency Mask */
#define HSDRAMC_CR_CAS(value)                 (HSDRAMC_CR_CAS_Msk & ((value) << HSDRAMC_CR_CAS_Pos))
#define   HSDRAMC_CR_CAS_LATENCY1_Val         _U_(0x1)                                             /**< (HSDRAMC_CR) 1 cycle latency  */
#define   HSDRAMC_CR_CAS_LATENCY2_Val         _U_(0x2)                                             /**< (HSDRAMC_CR) 2 cycle latency  */
#define   HSDRAMC_CR_CAS_LATENCY3_Val         _U_(0x3)                                             /**< (HSDRAMC_CR) 3 cycle latency  */
#define HSDRAMC_CR_CAS_LATENCY1               (HSDRAMC_CR_CAS_LATENCY1_Val << HSDRAMC_CR_CAS_Pos)  /**< (HSDRAMC_CR) 1 cycle latency Position  */
#define HSDRAMC_CR_CAS_LATENCY2               (HSDRAMC_CR_CAS_LATENCY2_Val << HSDRAMC_CR_CAS_Pos)  /**< (HSDRAMC_CR) 2 cycle latency Position  */
#define HSDRAMC_CR_CAS_LATENCY3               (HSDRAMC_CR_CAS_LATENCY3_Val << HSDRAMC_CR_CAS_Pos)  /**< (HSDRAMC_CR) 3 cycle latency Position  */
#define HSDRAMC_CR_DBW_Pos                    _U_(8)                                               /**< (HSDRAMC_CR) Data Bus Width Position */
#define HSDRAMC_CR_DBW_Msk                    (_U_(0x1) << HSDRAMC_CR_DBW_Pos)                     /**< (HSDRAMC_CR) Data Bus Width Mask */
#define HSDRAMC_CR_DBW(value)                 (HSDRAMC_CR_DBW_Msk & ((value) << HSDRAMC_CR_DBW_Pos))
#define HSDRAMC_CR_RMW_Pos                    _U_(9)                                               /**< (HSDRAMC_CR) Read Modify Write Position */
#define HSDRAMC_CR_RMW_Msk                    (_U_(0x1) << HSDRAMC_CR_RMW_Pos)                     /**< (HSDRAMC_CR) Read Modify Write Mask */
#define HSDRAMC_CR_RMW(value)                 (HSDRAMC_CR_RMW_Msk & ((value) << HSDRAMC_CR_RMW_Pos))
#define HSDRAMC_CR_Msk                        _U_(0x000003FF)                                      /**< (HSDRAMC_CR) Register Mask  */


/* -------- HSDRAMC_SDR : (HSDRAMC Offset: 0x0C) (R/W 32) Setup Delay Register -------- */
#define HSDRAMC_SDR_TWR_Pos                   _U_(0)                                               /**< (HSDRAMC_SDR) Write Recovery Delay Position */
#define HSDRAMC_SDR_TWR_Msk                   (_U_(0xF) << HSDRAMC_SDR_TWR_Pos)                    /**< (HSDRAMC_SDR) Write Recovery Delay Mask */
#define HSDRAMC_SDR_TWR(value)                (HSDRAMC_SDR_TWR_Msk & ((value) << HSDRAMC_SDR_TWR_Pos))
#define HSDRAMC_SDR_TRC_TRFC_Pos              _U_(4)                                               /**< (HSDRAMC_SDR) Row Cycle Delay and Row Refresh Cycle Position */
#define HSDRAMC_SDR_TRC_TRFC_Msk              (_U_(0xF) << HSDRAMC_SDR_TRC_TRFC_Pos)               /**< (HSDRAMC_SDR) Row Cycle Delay and Row Refresh Cycle Mask */
#define HSDRAMC_SDR_TRC_TRFC(value)           (HSDRAMC_SDR_TRC_TRFC_Msk & ((value) << HSDRAMC_SDR_TRC_TRFC_Pos))
#define HSDRAMC_SDR_TRP_Pos                   _U_(8)                                               /**< (HSDRAMC_SDR) Row Precharge Delay Position */
#define HSDRAMC_SDR_TRP_Msk                   (_U_(0xF) << HSDRAMC_SDR_TRP_Pos)                    /**< (HSDRAMC_SDR) Row Precharge Delay Mask */
#define HSDRAMC_SDR_TRP(value)                (HSDRAMC_SDR_TRP_Msk & ((value) << HSDRAMC_SDR_TRP_Pos))
#define HSDRAMC_SDR_TRCD_Pos                  _U_(12)                                              /**< (HSDRAMC_SDR) Row to Column Delay Position */
#define HSDRAMC_SDR_TRCD_Msk                  (_U_(0xF) << HSDRAMC_SDR_TRCD_Pos)                   /**< (HSDRAMC_SDR) Row to Column Delay Mask */
#define HSDRAMC_SDR_TRCD(value)               (HSDRAMC_SDR_TRCD_Msk & ((value) << HSDRAMC_SDR_TRCD_Pos))
#define HSDRAMC_SDR_TRAS_Pos                  _U_(16)                                              /**< (HSDRAMC_SDR) Active to Precharge Delay Position */
#define HSDRAMC_SDR_TRAS_Msk                  (_U_(0xF) << HSDRAMC_SDR_TRAS_Pos)                   /**< (HSDRAMC_SDR) Active to Precharge Delay Mask */
#define HSDRAMC_SDR_TRAS(value)               (HSDRAMC_SDR_TRAS_Msk & ((value) << HSDRAMC_SDR_TRAS_Pos))
#define HSDRAMC_SDR_TXSR_Pos                  _U_(20)                                              /**< (HSDRAMC_SDR) Exit Self-Refresh to Active Delay Position */
#define HSDRAMC_SDR_TXSR_Msk                  (_U_(0xF) << HSDRAMC_SDR_TXSR_Pos)                   /**< (HSDRAMC_SDR) Exit Self-Refresh to Active Delay Mask */
#define HSDRAMC_SDR_TXSR(value)               (HSDRAMC_SDR_TXSR_Msk & ((value) << HSDRAMC_SDR_TXSR_Pos))
#define HSDRAMC_SDR_Msk                       _U_(0x00FFFFFF)                                      /**< (HSDRAMC_SDR) Register Mask  */


